simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
#include "calibration.h"
#include "calibration_tables.h"
#include "psoc_adc.h"
#include "filter_coeffs.h"
#include "FIR_adquisition.h"
#include "FIR_calibration.h"

/* El servo lento y la busqueda binaria se borraron. El PI es el unico
 * algoritmo de calibracion; no hay selector ni ramas apagadas. */

/* Canal AMux_ADC del capacitor de filtrado (100nF a Vss, pin AMuxCapacitor en
 * TopDesign). AMux_ADC esta configurado en "All Modes" (AMux_ADC_ATMOSTONE=0,
 * ver AMux_ADC.h), es decir que el HARDWARE no impide tener varios canales
 * conectados a la vez -- la exclusion mutua entre canales de SEÑAL la tiene
 * que garantizar el software. psoc_amux_select_exclusive() es el unico punto
 * de entrada que toca AMux_ADC_Connect/Disconnect para que esa garantia viva
 * en un solo lugar: nunca conecta un canal nuevo sin desconectar antes el
 * anterior, asi que dos canales de señal jamas quedan en paralelo
 * (cortocircuito). El capacitor se trackea aparte y se puede dejar conectado
 * en paralelo a cualquier canal de señal a propósito -- durante la medición
 * de una etapa de calibración ayuda a filtrar ruido chico; durante
 * captura/idle se desconecta para no cargar la señal en vivo con capacitancia
 * extra.
 * El capacitor solo se conecta si el AMux tiene un canal extra despues de
 * las señales reales. En HAMMER actual AMux_ADC tiene solo dos señales
 * (PGA/LP); tratar el ultimo canal como capacitor mezclaba la etapa LP con
 * la PGA durante calibracion. */
#define CAL_AMUX_SIGNAL_CHANNEL_COUNT PSOC_AMUX_SIGNAL_CHANNEL_COUNT

#if PSOC_HW_CLASS == PSOC_HW_GEO
/* Los cinco taps son obligatorios. Un sexto canal de capacitor es opcional y
 * se detecta abajo; nunca se interpreta LPo como capacitor. */
#if AMux_ADC_CHANNELS < PSOC_AMUX_REQUIRED_CHANNELS
#error "AMux_ADC GEO debe tener 5 taps: PGA, BP, OPA_SUM, SUM y LP."
#endif
#endif

#ifndef CAL_AMUX_HAS_CAP_CHANNEL
#if (AMux_ADC_CHANNELS > CAL_AMUX_SIGNAL_CHANNEL_COUNT)
#define CAL_AMUX_HAS_CAP_CHANNEL 1u
#else
#define CAL_AMUX_HAS_CAP_CHANNEL 0u
#endif
#endif

#ifndef CAL_AMUX_CAP_CHANNEL
#if PSOC_HW_CLASS == PSOC_HW_GEO
#define CAL_AMUX_CAP_CHANNEL ((uint8)PSOC_AMUX_CH_CAP)
#else
#define CAL_AMUX_CAP_CHANNEL ((uint8)(AMux_ADC_CHANNELS - 1u))
#endif
#endif

#ifndef CAL_AMUX_CAP_CLEANUP_MS
#define CAL_AMUX_CAP_CLEANUP_MS 2u
#endif

static uint8 g_amux_active_channel = AMux_ADC_NULL_CHANNEL; /* uno de 0..3, o NULL */
static uint8 g_amux_cap_connected  = 0u;

static void psoc_amux_select_exclusive(uint8 channel, uint8 with_cap)
{
    if (g_amux_active_channel != AMux_ADC_NULL_CHANNEL &&
        g_amux_active_channel != channel) {
        AMux_ADC_Disconnect(g_amux_active_channel);
#if CAL_AMUX_HAS_CAP_CHANNEL
        /* Si el canal que se esta soltando ERA el del capacitor, el flag tiene
         * que caer con el. Si no, queda diciendo "conectado" sobre un canal ya
         * desconectado y el capacitor no se vuelve a conectar nunca: las
         * mediciones siguientes corren sin el filtro que creen tener. Solo
         * pasa si alguien mide el canal del capacitor como si fuera senal,
         * que es justo lo que hace el autotest en D1b. */
        if (g_amux_active_channel == CAL_AMUX_CAP_CHANNEL) {
            g_amux_cap_connected = 0u;
        }
#endif
        g_amux_active_channel = AMux_ADC_NULL_CHANNEL;
    }
    if (g_amux_active_channel != channel) {
        AMux_ADC_Connect(channel);
        g_amux_active_channel = channel;
    }

    if (with_cap && CAL_AMUX_HAS_CAP_CHANNEL) {
        if (!g_amux_cap_connected) {
            AMux_ADC_Connect(CAL_AMUX_CAP_CHANNEL);
            g_amux_cap_connected = 1u;
        }
    } else if (g_amux_cap_connected) {
        AMux_ADC_Disconnect(CAL_AMUX_CAP_CHANNEL);
        g_amux_cap_connected = 0u;
    }
}

static void psoc_amux_start(void)
{
    AMux_ADC_Start();   /* desconecta todos los canales, estado inicial conocido */
    g_amux_active_channel = AMux_ADC_NULL_CHANNEL;
    g_amux_cap_connected = 0u;
}

static void psoc_amux_disconnect_capacitor(void)
{
#if CAL_AMUX_HAS_CAP_CHANNEL
    AMux_ADC_Disconnect(CAL_AMUX_CAP_CHANNEL);
#endif
    g_amux_cap_connected = 0u;
}

static void psoc_amux_capacitor_cleanup(void)
{
#if CAL_AMUX_HAS_CAP_CHANNEL
    if (g_amux_active_channel != AMux_ADC_NULL_CHANNEL) {
        AMux_ADC_Disconnect(g_amux_active_channel);
        g_amux_active_channel = AMux_ADC_NULL_CHANNEL;
    }
    if (!g_amux_cap_connected) {
        AMux_ADC_Connect(CAL_AMUX_CAP_CHANNEL);
        g_amux_cap_connected = 1u;
    }
    CyDelay(CAL_AMUX_CAP_CLEANUP_MS);
#endif
}

#ifndef CAL_AMUX_ADC_START
#define CAL_AMUX_ADC_START() psoc_amux_start()
#endif

/* Selección de canal para operación normal/idle (canal de captura): sin
 * capacitor, exclusiva contra cualquier otro canal de señal. */
#ifndef CAL_AMUX_ADC_SELECT
#define CAL_AMUX_ADC_SELECT(channel) psoc_amux_select_exclusive((channel), 0u)
#endif

/* Selección de canal para MEDIR una etapa durante calibración.
 *
 * El capacitor auxiliar NO se conecta. En la placa del 2026-09-09 se verificó
 * que no era una carga transparente: con OPA_SUM/SUM realmente fuera de rango
 * bajo (~732/738 mV de banco), conectarlo los arrastraba hasta ~920 mV y creaba
 * una falsa deriva de varios minutos. Un lazo cerrado sobre esa lectura
 * calibra el capacitor, no el tap. El FIR digital ya filtra el ruido sin cargar
 * la planta y es la única vía de filtrado válida para el servo. */
#ifndef CAL_AMUX_ADC_SELECT_STAGE
#define CAL_AMUX_ADC_SELECT_STAGE(channel) psoc_amux_select_exclusive((channel), 0u)
#endif

static PsocCalDiagHook g_cal_diag_hook = (PsocCalDiagHook)0;

void psoc_calibration_set_diag_hook(PsocCalDiagHook hook)
{
    g_cal_diag_hook = hook;
}

static void cal_diag(uint8 event, uint8 value)
{
    if (g_cal_diag_hook != (PsocCalDiagHook)0) {
        g_cal_diag_hook(event, value);
    }
}

static void cal_diag_i16(uint8 event, int32 value)
{
    uint16 u;
    if (value > 32767L) { value = 32767L; }
    if (value < -32768L) { value = -32768L; }
    u = (uint16)(int16)value;
    cal_diag(event, (uint8)(u >> 8));
    cal_diag(event, (uint8)(u & 0xFFu));
}

