simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
/* Igual que cal_diag_i16 pero sin clamping: manda los 32 bits crudos de
 * "measured" (cum_avg interno) en 4 bytes MSB-first con el mismo evento.
 * cal_diag_i16 satura a +-32767 para la telemetria historica; ese clamping
 * hace que cualquier |measured|>32767 se vea identico (siempre 32767 o
 * -32768) y oculta si el mejor punto quedo "apenas" o "muy" fuera de
 * CAL_OPERATING_RANGE_COUNTS (ver HANDOFF_CALIBRATION.md). */
static void cal_diag_i32(uint8 event, int32 value)
{
    uint32 u = (uint32)value;
    cal_diag(event, (uint8)((u >> 24) & 0xFFu));
    cal_diag(event, (uint8)((u >> 16) & 0xFFu));
    cal_diag(event, (uint8)((u >> 8) & 0xFFu));
    cal_diag(event, (uint8)(u & 0xFFu));
}

static int32 abs_counts(int32 value)
{
    return (value < 0) ? -value : value;
}

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 0u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

#ifndef CAL_ADC_DIRECT_CONVERSION_MS
/* El ADC DelSig entrega a 2604 Sa/s en la configuracion de calibracion. La
 * ISR de la ruta filtrada tambien lee el status de fin de conversion, por lo
 * que hacer polling de ADC_IsEndConversion(RETURN_STATUS) desde foreground
 * tiene una carrera: la ISR puede consumir todos los flags y el viejo helper
 * terminaba devolviendo un cero inventado. El Delta-Sigma conserva memoria
 * de su propio filtro decimador al cambiar AMux: 2 ms alcanzaban para obtener
 * un dato nuevo, pero no uno asentado (el error era especialmente visible al
 * pasar de SUM a LP). Treinta milisegundos dejan unas 78 conversiones reales
 * y solo agregan ~120 ms al precheck completo de cuatro etapas. */
#define CAL_ADC_DIRECT_CONVERSION_MS 30u
#endif

/* El servo de offset necesita el valor DC del tap, no la ruta DMA/DFB que se
 * reconfigura al entrar y salir de adquisicion. En banco el ADC directo dio
 * medidas repetibles, mientras el ultimo valor del DFB podia corresponder al
 * transitorio de la ruta anterior y cerraba falsamente cerca del target. */
#ifndef CAL_PI_USE_DIRECT_ADC
#define CAL_PI_USE_DIRECT_ADC 1u
#endif

/* ==========================================================================
 * UNA ITERACION DEL LAZO NO ES UNA MUESTRA DEL ADC
 *
 * Todas las esperas de las tablas estan en MUESTRAS del ADC a su velocidad
 * nativa, y esa unidad es la correcta: lo que se espera es tiempo fisico -tau
 * de la planta, el techo del watchdog- y muestras a 2604 Hz es como se
 * expresa el tiempo en el resto del firmware.
 *
 * Pero el lazo NO corre a 2604 Hz. Con el lector directo, cada iteracion para
 * el ADC, lo arranca de nuevo y espera CAL_ADC_DIRECT_CONVERSION_MS = 30 ms a
 * que el decimador del Delta-Sigma se asiente. Una iteracion son 30 ms, no
 * 0,384 ms: 78 veces mas lenta.
 *
 * Los contadores se decrementan por ITERACION, asi que sin esta conversion el
 * error es de ese factor y va en las dos direcciones:
 *   - la espera de planta de 2 tau (153.620 muestras = 59 s) se volveria de
 *     77 minutos;
 *   - el techo de 30.000 muestras (11,5 s) se volveria de 15 minutos, o sea
 *     que el watchdog dejaria de proteger nada.
 *
 * Por eso toda espera se declara en muestras -que es tiempo- y se convierte a
 * iteraciones en el punto de uso.
 * ========================================================================== */
#if CAL_PI_USE_DIRECT_ADC
/* Cuantas muestras nativas dura una iteracion: 2604 Hz x 30 ms = 78. */
#define CAL_PI_SAMPLES_PER_ITER \
    (((uint32)PSOC_ADC_NATIVE_FS_HZ * (uint32)CAL_ADC_DIRECT_CONVERSION_MS) / 1000UL)
#else
/* Por la ruta del FIR el lazo si consume una muestra por iteracion. */
#define CAL_PI_SAMPLES_PER_ITER 1UL
#endif

static uint32 cal_pi_samples_to_iters(uint32 samples)
{
    uint32 iters;

    if (samples == 0UL) {
        return 0UL;
    }
    iters = samples / CAL_PI_SAMPLES_PER_ITER;
    /* Una espera pedida distinta de cero nunca se convierte en ninguna: eso
     * seria saltearse un settle porque la division quedo corta. */
    return (iters == 0UL) ? 1UL : iters;
}

static int32 cal_adc_read_direct_counts(void)
{
    int32 sample;

    ADC_StopConvert();
    ADC_StartConvert();
    CyDelay(CAL_ADC_DIRECT_CONVERSION_MS);
    sample = ADC_GetResult32();
    ADC_StopConvert();

    return psoc_adc_counts_right_aligned(sample);
}

static uint8 cal_pi_take_control_sample(int32 *sample)
{
#if CAL_PI_USE_DIRECT_ADC
    if (sample == (int32 *)0) {
        return 0u;
    }
    *sample = cal_adc_read_direct_counts();
    return 1u;
#else
    return psoc_adc_take_isr_filtered_sample(sample);
#endif
}

static int32 cal_pi_compare_counts(int32 measured)
{
#if PSOC_HW_CLASS == PSOC_HW_HAMMER
    return abs_counts(measured);
#else
    /* Los taps GEO descansan fisicamente sobre Vref ~= 1 V; el cero que se
     * calibra es la componente diferencial alrededor de ese modo comun. El
     * ADC entrega el nivel absoluto (unas 52429 cuentas/V en CF_2V5), por lo
     * que centrar aqui mantiene los targets de las tablas expresados en el
     * dominio correcto: 0 counts == tap exactamente en Vref. La telemetria
     * conserva `measured` crudo y expone `cmp` ya centrado. */
    return measured - CAL_TARGET_1V_COUNTS;
#endif
}

#if CAL_DIAG_SWEEP_ENABLE
static void cal_diag_sweep_stage(const PsocCalStage *stage)
{
    /* Los tres puntos del barrido de diagnostico ahora recorren el rango con
     * signo: un extremo, el centro (que es Vref) y el otro extremo. */
    static const int16 sweep_dac[3] = { -PSOC_IDAC_SIGNED_MAX, 0, PSOC_IDAC_SIGNED_MAX };
    uint8 i;

    for (i = 0u; i < 3u; i++) {
        stage->write(sweep_dac[i]);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag_i16(PSOC_EVT_CAL_SWEEP_DAC, (int32)sweep_dac[i]);
        cal_diag_i32(PSOC_EVT_CAL_SWEEP_MEAS32, cal_adc_read_direct_counts());
    }
}
#endif

/* Rango de la etapa, EN CODIGOS CON SIGNO. El piso puede ser negativo: con
 * dac_center = 0 y dac_max_change = 255 el rango es -255..+255, que es todo el
 * punto de haber cableado polarity_reg. Con la version sin signo el piso daba 0
 * y la mitad negativa quedaba muerta sin que nada lo dijera. */
/* --------------------------------------------------------------------------
 * RANGO UTIL DE LA ETAPA 0, QUE NO ES SU RANGO DE CODIGOS
 *
 * Medido el 2026-09-05 (EXP1): la pendiente del IDAC de la etapa 0 sobre su
 * propio tap escala con la ganancia del PGA, porque inyecta ANTES de amplificar.
 *
 *     PGA        x1      x8     x16     x32     x50
 *     uV/codigo  62,0   460,5   927,5  1774    2688
 *
 * Eso es una buena noticia -el offset de entrada y la autoridad para corregirlo
 * crecen juntos, asi que la razon es constante y x50 se puede calibrar- pero
 * tiene una consecuencia que el firmware no contemplaba: la EXCURSION del tap no
 * crece. Los rieles medidos son 759,4 y 1114,4 mV, o sea 355 mV, y a x50 eso son
 *
 *     355 mV / 2688 uV por codigo = 132 codigos, +-66 alrededor del centro.
 *
 * Las otras dos terceras partes del rango del IDAC no existen: son riel. Y
 * contra el riel la pendiente es CERO, asi que el lazo empuja sin efecto, la
 * integral se enrolla y el DAC termina en el extremo. Es el modo de falla que
 * mas veces se observo.
 *
 * Por eso el clamp de la etapa 0 escala con 1/ganancia. El numero sale del
 * cociente entre la excursion medida y la pendiente medida, no de un margen
 * elegido a ojo:
 *
 *     codigos utiles = excursion_uV / (uV_por_codigo_a_x1 * ganancia)
 *
 * Se deja un 20 % de margen porque la excursion depende de donde este parado el
 * offset, que es justo lo que la calibracion todavia no sabe cuando arranca.
 * -------------------------------------------------------------------------- */

