simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
static uint8 cal_pi_run_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 sample;
    int32 control_sample;
    int32 error_counts;
    int32 error_dac;
    int32 control_error;
    int32 effort;
    int32 p_term;
    int32 i_term;
    int32 stage_gain_x1000;
    int32 deadband_counts;
    int32 error_bucket;
    int32 dac_max_step_up;
    int32 dac_max_step_down;
    /* uint32 igual que samples_taken: si se queda en uint16 vuelve a
     * truncar justo lo que se acaba de ensanchar. Hoy no se nota porque
     * el contador se resetea al terminar el settle y el timeout es 45000,
     * pero es la misma trampa esperando a que alguien suba el techo. */
    uint32 sample_index;
    uint16 lock_n;
    int16 dac_sample;
    int16 dac_lo;
    int16 dac_hi;
    int16 dac_target;
    int16 dac_step;
    uint8 can_integrate;
    uint8 dac_changed;
    int8 effort_delta_sign;
#if PSOC_HW_CLASS == PSOC_HW_GEO
    uint8 gain_iteration;
    int16 gain_probe_dac;
#endif

    if (!cal_pi_take_control_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }
    g_cal_pi.empty_polls = 0UL;

    /* Sin promediado/EMA en software: el FIR de hardware (Canal A del
     * Filter, FIR_calibration.h) ya extrajo el DC -- fir_output es
     * directamente la muestra filtrada. */
    g_cal_pi.last_fir_output = sample;
    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error_counts = stage->target_counts - control_sample;
    sample_index = g_cal_pi.samples_taken + 1UL;
    g_cal_pi.samples_taken = sample_index;



    /* Cada salida del FIR mezcla 128 entradas. Despues de mover el DAC se
     * retiene el siguiente ajuste hasta que todas correspondan al codigo
     * nuevo; sin esto el PI persigue una medida vieja y llega a los rieles. */
    if (g_cal_pi.control_hold_remaining > 0u) {
        g_cal_pi.control_hold_remaining--;
        if (g_cal_pi.control_hold_remaining > 0u) {
            if (g_cal_pi.samples_taken >= cal_pi_samples_to_iters(cfg->timeout_samples)) {
                return cal_pi_finish_stage(0u);
            }
            return 0u;
        }
    }

    /* EL RESCATE VA DESPUES DE LA ESPERA, no antes. Estuvo un rato antes y el
     * efecto fue inmediato y total: el bloque se disparaba en CADA iteracion
     * del lazo -una cada 30 ms- en vez de una vez por tau, asi que empujaba al
     * actuador 31 codigos cada 30 ms y lo llevaba al extremo en menos de un
     * segundo. La calibracion entera duraba 121 s, que es lo que suman las dos
     * esperas de entrada y nada mas. Medido el 2026-09-06. */
    /* ----------------------------------------------------------------------
     * RESCATE EN LAZO ABIERTO. Antes de dejar que el PI mire este numero, hay
     * que preguntarse si el numero significa algo. Si el tap esta fuera de la
     * ventana observable la lectura no depende del tap, asi que no se puede
     * realimentar: lo unico sensato es empujar a ciegas en la direccion que se
     * sabe correcta y volver a mirar despues de que la planta conteste.
     *
     * La direccion se sabe sin medir nada: si la lectura esta por DEBAJO de la
     * ventana hay que SUBIR el tap, y para eso el codigo se mueve al reves del
     * signo de la ganancia de la etapa -en el ADDER, subir la referencia baja
     * la salida del LP, de ahi que su ganancia sea negativa-.
     *
     * Esto no reemplaza al lazo: lo habilita. Sin la ventana, el PI no tenia
     * forma de distinguir "estoy lejos" de "no estoy viendo", y trataba lo
     * segundo como lo primero.
     * ---------------------------------------------------------------------- */
    if (!cal_medida_en_ventana(g_cal_pi.last_fir_output)) {
        int32 gain_rescate = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
        int16 paso = cal_paso_rescate(stage);
        int32 destino;

        if (g_cal_pi.last_fir_output < CAL_VENTANA_MIN_COUNTS) {
            /* Hay que subir el tap. */
            paso = (gain_rescate < 0L) ? (int16)(-paso) : paso;
        } else {
            paso = (gain_rescate < 0L) ? paso : (int16)(-paso);
        }
        destino = (int32)g_cal_pi.dac_current + (int32)paso;
        if (destino < (int32)cal_stage_min_dac(stage)) {
            destino = (int32)cal_stage_min_dac(stage);
        } else if (destino > (int32)cal_stage_max_dac(stage)) {
            destino = (int32)cal_stage_max_dac(stage);
        }

        if ((int16)destino == g_cal_pi.dac_current) {
            /* El actuador ya esta en su extremo y el tap sigue sin verse: esta
             * etapa no puede hacer mas. Se cierra con ok=0, que es la verdad, y
             * se le deja el turno a la siguiente en vez de gastar el timeout. */
            return cal_pi_finish_stage(0u);
        }

        g_cal_pi.dac_current = (int16)destino;
        stage->write(g_cal_pi.dac_current);
        g_cal_pi.integral = 0L;          /* nada de lo acumulado a ciegas sirve */
        g_cal_pi.stable_count = 0u;
        g_cal_pi.control_hold_remaining = cal_pi_samples_to_iters(
            (uint32)cfg->settle_samples + psoc_cal_step_settle_samples());
        if (g_cal_pi.samples_taken >= cal_pi_samples_to_iters(cfg->timeout_samples)) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }

    /* error_dac se conserva solo para telemetria compatible. El control y la
     * banda trabajan en counts para no perder la parte fraccionaria. */
    error_dac = cal_counts_error_to_dac_scale(error_counts);
    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    deadband_counts = cal_pi_deadband_counts(g_cal_async.stage_index);
    control_error = (abs_counts(error_counts) <= deadband_counts) ? 0L : error_counts;
    error_bucket = cal_pi_error_bucket(error_counts, deadband_counts);
    dac_sample = g_cal_pi.dac_current;

